app/controllers/items_controller.rb

INSERT INTO "items" ("created_at", "updated_at", "text", "list_id") VALUES('2010-04-08 05:06:33', '2010-04-08 05:06:33', 'Do this.', 980190962)
---
  def create
    @item = @list.items.new(params[:item])

    respond_to do |format|
      if @item.save

SELECT * FROM "items" WHERE ("items"."id" = 980190962 AND ("items".list_id = 980190962))
DELETE FROM "items" WHERE "id" = 980190962
---
  def destroy
    @item = @list.items.find(params[:id])
    @item.destroy

SELECT * FROM "lists" WHERE ("lists"."id" = 980190962)
---
  def find_list
    @list = List.find(params[:list_id])