app/controllers/lists_controller.rb

  def index
    @lists = List.all
---
SELECT * FROM "lists"

  def show
    @list = List.find(params[:id])
---
SELECT * FROM "lists" WHERE ("lists"."id" = 980190962)

  def create
    @list = List.new(params[:list])

    respond_to do |format|
      if @list.save
---
INSERT INTO "lists" ("name", "created_at", "updated_at") VALUES(NULL, '2010-04-08 04:56:47', '2010-04-08 04:56:47')

  def destroy
    @list = List.find(params[:id])
    @list.destroy
---
SELECT * FROM "lists" WHERE ("lists"."id" = 980190962)
DELETE FROM "lists" WHERE "id" = 980190962